Documents/УстановкаЦенМатериаловПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенМатериаловПоставщиков</Name>
			<Comment>Установка цен на продукцию поставщиков</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныМатериаловПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСФотопечатью</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныМатериаловПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериаловПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенМатериаловПоставщиков/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ОбновитьЭлементыФормы();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораФактуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	ВалютаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыМатериалов

#КонецОбласти

#Область ОбработчикиКомандТаблицыМатериалов

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораФактуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаФактур = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	УстановкаЦенСервер.ОбработкаВыбораПодбораФактуры(ТаблицаФактур, Объект.Материалы);
	//Для Каждого ТекущаяСтрока из ТаблицаФактур Цикл
	//	СтруктураОтбора = Новый Структура("Фактура, ЦветФактуры", ТекущаяСтрока.Фактура, ТекущаяСтрока.ЦветФактуры);
	//	НайденныеСтроки = Объект.Материалы.НайтиСтроки(СтруктураОтбора);
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		НоваяСтрока = Объект.Материалы.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	//	КонецЕсли;
	//КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоСправочнику(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуФактур(ЭтаФорма, Объект.Материалы);
	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоСправочникуФактурЗавершение",ЭтаФорма);
	//ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить таблицу и заполнить всеми элементами из справочника фактур?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуФактурЗавершение(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьПоСправочникуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСправочникуНаСервере()
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы);
	
	//Объект.Материалы.Очистить();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Фактура.Ссылка КАК Фактура,
	//|	ЦветФактуры.Ссылка КАК ЦветФактуры
	//|ИЗ
	//|	Справочник.Фактура КАК Фактура
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦветФактуры КАК ЦветФактуры
	//|		ПО Фактура.Ссылка = ЦветФактуры.Владелец
	//|ГДЕ
	//|	НЕ Фактура.ЭтоГруппа
	//|	И НЕ Фактура.ПометкаУдаления";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НоваяСтрока = Объект.Материалы.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныТекущимЗначением(Команда)
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветЗаполнитьТекущиеЦены",ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить цены и заполнить текущими значениями?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветЗаполнитьТекущиеЦены(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьЦеныТекущимЗначениемНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныТекущимЗначениемНаСервере()
	
	ДатаЦены = Объект.Дата;
	Если ДатаЦены = Дата(1,1,1) Тогда
		ДатаЦены = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		ТекущаяСтрока.Цена = РегистрыСведений.ЦеныМатериаловПоставщиков.ПолучитьЦенуМатериалаВВалюте(ДатаЦены, Объект.Контрагент, ТекущаяСтрока.Фактура, ТекущаяСтрока.ЦветФактуры, Объект.Валюта, Объект.ВидНоменклатуры, Объект.ВидЦеныПоставщика);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеСправочника(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеФактур(ЭтаФорма, Объект.Материалы);
	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветЗаполнитьПоГруппе",ЭтаФорма);
	//ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить таблицу и заполнить элементами из справочника фактур по выбранной группе?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОтветЗаполнитьПоГруппе(Результат, Параметры) Экспорт
//    Если Результат = КодВозвратаДиалога.Нет Тогда
//        Возврат;
//    КонецЕсли;

//	ОписаниеОповещенияВыборГруппы = Новый ОписаниеОповещения("РезультатВыбораГруппы",ЭтаФорма);
//	ОткрытьФорму("Справочник.Фактура.ФормаВыбораГруппы",,,,,,ОписаниеОповещенияВыборГруппы);

//КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеФактурПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГруппеНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеНаСервере(ГруппаФактур)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, ГруппаФактур);
	
	//Объект.Материалы.Очистить();
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	Фактура.Ссылка КАК Фактура,
	//	|	ЦветФактуры.Ссылка КАК ЦветФактуры
	//	|ИЗ
	//	|	Справочник.Фактура КАК Фактура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦветФактуры КАК ЦветФактуры
	//	|		ПО Фактура.Ссылка = ЦветФактуры.Владелец
	//	|ГДЕ
	//	|	НЕ Фактура.ЭтоГруппа
	//	|	И НЕ Фактура.ПометкаУдаления
	//	|	И Фактура.Ссылка В ИЕРАРХИИ(&ВыбЗнач)";
	//	Запрос.УстановитьПараметр("ВыбЗнач",ВыбЗнач);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		НоваяСтрока = Объект.Материалы.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦену(Команда)
	
	УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Объект.Материалы);
	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОтветУстановитьОбщуюЦену",ЭтаФорма);
	//ПоказатьВопрос(ОписаниеОповещенияВопрос,"Установить общую цену на все фактуры и цвета?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОтветУстановитьОбщуюЦену(Результат, Параметры) Экспорт
//    Если Результат = КодВозвратаДиалога.Нет Тогда
//        Возврат;
//    КонецЕсли;

//	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("УстановитьЦенуПослеВыбора",ЭтаФорма);
//	ПоказатьВводЗначения(ОписаниеОповещенияВыборЦены,0,"Введите цену");

//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьЦенуПослеВыбора(ВыбЗнач, Параметры) Экспорт
//    Если НЕ ВыбЗнач = Неопределено Тогда
//		
//		Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
//			ТекущаяСтрока.Цена = ВыбЗнач;
//		КонецЦикла;
//		
//    КонецЕсли;
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункцииПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.МатериалыЦена.Заголовок = "Цена, " + Объект.Валюта;
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
